1password
1password-cli
brave-bin
clipman
clipman-debug
cpupower-gui
ddcci-driver-linux-dkms
evhz-git
evhz-git-debug
microsoft-edge-beta-bin
nvm
ookla-speedtest-bin
paru
paru-debug
python312
safeeyes
snapd
snixembed
snixembed-debug
teams
teams-debug
tidal-hifi-git
tidal-hifi-git-debug
ttf-maple-beta
visual-studio-code-bin
visual-studio-code-bin-debug
yay
yay-debug
zen-browser-bin
zoom
