cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'ValeLint/vale'

tap 'neovim/neovim'

# Install homebrew packages
brew 'grc' 
brew 'coreutils'

# Install Binaries
brew 'tmux'
brew 'tmux-mem-cpu-load'
brew 'awscli'
brew 'hub'
brew 'tree'
brew 'mas'
brew 'node'
brew 'trash'
brew 'fzf'
brew 'htop'
brew 'the_silver_searcher'
brew 'ranger'

tap 'universal-ctags/universal-ctags'
brew 'universal-ctags', args: ['HEAD']

# Devops
#cask 'virtualbox'
#cask 'virtualbox-extension-pack'
cask 'vagrant'
brew 'ansible'
brew 'terraform'
brew 'packer'

# Programming
brew 'python'
brew 'rbenv'
brew 'go'
brew 'ruby-build'
brew 'rbenv-default-gems'

# install neovim
brew 'neovim', args: ['HEAD']
brew 'vale'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-hack'
cask 'font-dejavusansmono-nerd-font-mono'
cask 'font-ia-writer-duospace'

# APPS
cask 'ksdiff'
cask '1password'
cask 'dropbox'
cask 'aerial'
cask 'alfred'
cask 'caffeine'
cask 'docker'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'authy'
cask 'iterm2'
cask 'java'
cask 'now'
cask 'sequel-pro'
cask 'slack'
cask 'torbrowser'
cask 'tower'
cask 'transmit'
cask 'vlc'
cask 'paw'  
cask 'evernote'
cask 'visual-studio-code'
cask 'little-snitch'
cask 'flux'
cask 'the-unarchiver'

# Work
brew 'kubernetes-cli'
brew 'helm'
brew 'yarn'
brew 'mkcert'
brew 'gettext'
brew 'git-buildnumber'
brew 'minikube'

# Gaming
cask 'steam'
cask 'openttd'
