1password
1password-cli
7zip
arc-gtk-theme
aws-cli
base
base-devel
bat
blueman
bluez
bluez-utils
boost
brave-bin
brightnessctl
chafa
cliphist
clipman
cloc
cpupower-gui
cronie
ddcci-driver-linux-dkms
debugedit
dhcpcd
discord
docker
docker-compose
dunst
easyeffects
efibootmgr
entr
evhz-git
eza
fakeroot
fastfetch
fd
firefox
flameshot
font-manager
fzf
gcc
ghostty
git
git-delta
glow
gnome-backgrounds
gnome-boxes
gnome-calculator
gnome-console
gnome-control-center
gnome-disk-utility
gnome-keyring
gnome-menus
gnome-multi-writer
gnome-nettool
gnome-power-manager
gnome-screenshot
gnome-shell
gnome-shell-extensions
gnome-system-monitor
gnome-text-editor
gnome-themes-extra
gnome-tweaks
gnome-usage
grub
haskell-uuid
helm
highlight
htop
httpie
hwinfo
hypridle
hyprland
hyprlock
hyprpaper
i3-wm
i3lock
i3status
jq
jre-openjdk
kitty
kubectl
lazygit
libreoffice-fresh
linux
linux-firmware
luarocks
lxappearance
ly
maim
markdownlint-cli2
mesa-utils
microsoft-edge-beta-bin
nano
neofetch
neovim
network-manager-applet
networkmanager
noto-fonts-emoji
npm
obsidian
ollama
ookla-speedtest-bin
openssh
opentofu
os-prober
pamixer
pandoc-cli
paru
pavucontrol
pipewire-audio
polybar
powertop
prettier
python-pip
python-pipx
python-poetry
python-pynvim
python312
qpwgraph
reflector
ripgrep
rofi
safeeyes
scrot
shellcheck
snapd
snixembed
starship
sudo
systemd-resolvconf
teams
terraform
throttled
thunar
tidal-hifi-git
tldr
tmux
tree
ttf-bitstream-vera
ttf-dejavu
ttf-fira-code
ttf-firacode-nerd
ttf-jetbrains-mono-nerd
ttf-maple-beta
ttf-nerd-fonts-symbols-mono
ttf-noto-nerd
ttf-opensans
ueberzugpp
vim
visual-studio-code-bin
viu
waybar
wdiff
wezterm
wget
wireguard-tools
wofi
xclip
xdg-desktop-portal-hyprland
xdotool
xf86-video-intel
xf86-video-vesa
xorg-bdftopcf
xorg-docs
xorg-font-util
xorg-fonts-100dpi
xorg-fonts-75dpi
xorg-fonts-encodings
xorg-iceauth
xorg-mkfontscale
xorg-server
xorg-server-common
xorg-server-devel
xorg-server-xephyr
xorg-server-xnest
xorg-server-xvfb
xorg-sessreg
xorg-setxkbmap
xorg-smproxy
xorg-x11perf
xorg-xauth
xorg-xbacklight
xorg-xcmsdb
xorg-xcursorgen
xorg-xdpyinfo
xorg-xdriinfo
xorg-xev
xorg-xgamma
xorg-xhost
xorg-xinit
xorg-xinput
xorg-xkbcomp
xorg-xkbevd
xorg-xkbprint
xorg-xkbutils
xorg-xkill
xorg-xlsatoms
xorg-xlsclients
xorg-xlsfonts
xorg-xmodmap
xorg-xpr
xorg-xprop
xorg-xrandr
xorg-xrdb
xorg-xrefresh
xorg-xset
xorg-xsetroot
xorg-xvinfo
xorg-xwayland
xorg-xwd
xorg-xwininfo
xorg-xwud
xsel
yay
yay-debug
yazi
z
zed
zellij
zen-browser-bin
zoom
zoxide
zsh
